CSI API ETABS v1

# eMatTypeAluminum Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eMatTypeAluminum

    Public Enumeration eMatTypeAluminum

    Dim instance As eMatTypeAluminum

    public enum class eMatTypeAluminum

    type eMatTypeAluminum

Members

| Member name| Value| Description
---|---|---|---
| SubType_6061_T6| 1|
| SubType_6063_T6| 2|
| SubType_5052_H34| 3|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com